In [1]:
import pandas as pd
import itertools as it

In [2]:
data = pd.read_csv('movie_bd_v5.csv')

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year
1676,tt0413300,258000000,890871626,Spider-Man 3,Tobey Maguire|Kirsten Dunst|James Franco|Thoma...,Sam Raimi,The battle within.,The seemingly invincible Spider-Man goes up ag...,139,Fantasy|Action|Adventure,Columbia Pictures|Laura Ziskin Productions|Mar...,5/1/2007,5.8,2007

In [3]:
data.describe()

             budget       revenue      runtime  vote_average  release_year
count  1.889000e+03  1.889000e+03  1889.000000   1889.000000   1889.000000
mean   5.431083e+07  1.553653e+08   109.658549      6.140762   2007.860773
std    4.858721e+07  2.146698e+08    18.017041      0.764763      4.468841
min    5.000000e+06  2.033165e+06    63.000000      3.300000   2000.000000
25%    2.000000e+07  3.456058e+07    97.000000      5.600000   2004.000000
50%    3.800000e+07  8.361541e+07   107.000000      6.100000   2008.000000
75%    7.200000e+07  1.782626e+08   120.000000      6.600000   2012.000000
max    3.800000e+08  2.781506e+09   214.000000      8.100000   2015.000000

# Предобработка

In [6]:
# So we need to change this in datetime format:
data['release_date'] = pd.to_datetime(data['release_date'])
# Add column 'profit':
data['profit'] = data.revenue - data.budget
answers = {}

# 1. У какого фильма из списка самый большой бюджет?

Использовать варианты ответов в коде решения запрещено.    
Вы думаете и в жизни у вас будут варианты ответов?)

In [7]:
answers['1'] = '1. Pirates of the Caribbean: On Stranger Tides (tt1298650)'

In [8]:
data.query("budget == budget.max()")

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit
723,tt1298650,380000000,1021683000,Pirates of the Caribbean: On Stranger Tides,Johnny Depp|PenÃ©lope Cruz|Geoffrey Rush|Ian M...,Rob Marshall,Live Forever Or Die Trying.,Captain Jack Sparrow crosses paths with a woma...,136,Adventure|Action|Fantasy,Walt Disney Pictures|Jerry Bruckheimer Films|M...,2011-05-11,6.3,2011,641683000

ВАРИАНТ 2

In [9]:
data[data['budget'] == data['budget'].max()]

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit
723,tt1298650,380000000,1021683000,Pirates of the Caribbean: On Stranger Tides,Johnny Depp|PenÃ©lope Cruz|Geoffrey Rush|Ian M...,Rob Marshall,Live Forever Or Die Trying.,Captain Jack Sparrow crosses paths with a woma...,136,Adventure|Action|Fantasy,Walt Disney Pictures|Jerry Bruckheimer Films|M...,2011-05-11,6.3,2011,641683000

# 2. Какой из фильмов самый длительный (в минутах)?

In [10]:
answers['2'] = '2. Gods and Generals (tt0279111)'

In [11]:
data.query("runtime == runtime.max()")

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit
1157,tt0279111,56000000,12923936,Gods and Generals,Stephen Lang|Jeff Daniels|Robert Duvall|Kevin ...,Ronald F. Maxwell,The nations heart was touched by...,The film centers mostly around the personal an...,214,Drama|History|War,Turner Pictures|Antietam Filmworks,2003-02-21,5.8,2003,-43076064

In [12]:
# Variand 2:

data[data['runtime'] == data['runtime'].max()]

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit
1157,tt0279111,56000000,12923936,Gods and Generals,Stephen Lang|Jeff Daniels|Robert Duvall|Kevin ...,Ronald F. Maxwell,The nations heart was touched by...,The film centers mostly around the personal an...,214,Drama|History|War,Turner Pictures|Antietam Filmworks,2003-02-21,5.8,2003,-43076064

# 3. Какой из фильмов самый короткий (в минутах)?

In [13]:
answers['3'] = '3. Winnie the Pooh (tt1449283)'

In [14]:
data.query("runtime == runtime.min()")

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit
768,tt1449283,30000000,14460000,Winnie the Pooh,Jim Cummings|Travis Oates|Jim Cummings|Bud Luc...,Stephen Anderson|Don Hall,Oh Pooh.,"During an ordinary day in Hundred Acre Wood, W...",63,Animation|Family,Walt Disney Pictures|Walt Disney Animation Stu...,2011-04-13,6.8,2011,-15540000

In [15]:
# Variand 2:

data[data['runtime'] == data['runtime'].min()]

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit
768,tt1449283,30000000,14460000,Winnie the Pooh,Jim Cummings|Travis Oates|Jim Cummings|Bud Luc...,Stephen Anderson|Don Hall,Oh Pooh.,"During an ordinary day in Hundred Acre Wood, W...",63,Animation|Family,Walt Disney Pictures|Walt Disney Animation Stu...,2011-04-13,6.8,2011,-15540000

# 4. Какова средняя длительность фильмов?

In [16]:
answers['4'] = '4. 109.6585494970884'

In [17]:
data.runtime.mean()

109.6585494970884

In [18]:
# Variand 2:

data['runtime'].mean()

109.6585494970884

# 5. Каково медианное значение длительности фильмов?

In [19]:
answers['5'] = '5. 107'

In [20]:
data.runtime.median()

107.0

In [21]:
# Variand 2:

data['runtime'].median()

107.0

# 6. Какой самый прибыльный фильм?
#### Внимание! Здесь и далее под «прибылью» или «убытками» понимается разность между сборами и бюджетом фильма. (прибыль = сборы - бюджет) в нашем датасете это будет (profit = revenue - budget)

In [22]:
answers['6'] = '6. Avatar (tt0499549)'

In [23]:
data.query('profit == profit.max()')

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit
239,tt0499549,237000000,2781505847,Avatar,Sam Worthington|Zoe Saldana|Sigourney Weaver|S...,James Cameron,Enter the World of Pandora.,"In the 22nd century, a paraplegic Marine is di...",162,Action|Adventure|Fantasy|Science Fiction,Ingenious Film Partners|Twentieth Century Fox ...,2009-12-10,7.1,2009,2544505847

In [24]:
# Variand 2:

data[data['profit'] == data['profit'].max()]

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit
239,tt0499549,237000000,2781505847,Avatar,Sam Worthington|Zoe Saldana|Sigourney Weaver|S...,James Cameron,Enter the World of Pandora.,"In the 22nd century, a paraplegic Marine is di...",162,Action|Adventure|Fantasy|Science Fiction,Ingenious Film Partners|Twentieth Century Fox ...,2009-12-10,7.1,2009,2544505847

# 7. Какой фильм самый убыточный?

In [25]:
answers['7'] = '7. The Lone Ranger (tt1210819)'

In [26]:
data.query('profit == profit.min()')

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit
1245,tt1210819,255000000,89289910,The Lone Ranger,Johnny Depp|Armie Hammer|William Fichtner|Hele...,Gore Verbinski,Never Take Off the Mask,The Texas Rangers chase down a gang of outlaws...,149,Action|Adventure|Western,Walt Disney Pictures|Jerry Bruckheimer Films|I...,2013-07-03,6.0,2013,-165710090

In [27]:
# Variand 2:

data[data['profit'] == data['profit'].min()]

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit
1245,tt1210819,255000000,89289910,The Lone Ranger,Johnny Depp|Armie Hammer|William Fichtner|Hele...,Gore Verbinski,Never Take Off the Mask,The Texas Rangers chase down a gang of outlaws...,149,Action|Adventure|Western,Walt Disney Pictures|Jerry Bruckheimer Films|I...,2013-07-03,6.0,2013,-165710090

# 8. У скольких фильмов из датасета объем сборов оказался выше бюджета?

In [28]:
answers['8'] = '8. 1478'

In [29]:
data.query('revenue > budget').imdb_id.count()

1478

In [30]:
# Variand 2:

data[data['revenue'] > data['budget']].imdb_id.count()

1478

# 9. Какой фильм оказался самым кассовым в 2008 году?

In [31]:
answers['9'] = '9. The Dark Knight (tt0468569)'

In [32]:
data2 = data.query('release_year == 2008')
data2.query('revenue == revenue.max()')

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit
599,tt0468569,185000000,1001921825,The Dark Knight,Christian Bale|Michael Caine|Heath Ledger|Aaro...,Christopher Nolan,Why So Serious?,Batman raises the stakes in his war on crime. ...,152,Drama|Action|Crime|Thriller,DC Comics|Legendary Pictures|Warner Bros.|Syncopy,2008-07-16,8.1,2008,816921825

In [33]:
# Variand 2:

data2 = data[data['release_year'] == 2008]
data2[data2['revenue'] == data2['revenue'].max()]

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit
599,tt0468569,185000000,1001921825,The Dark Knight,Christian Bale|Michael Caine|Heath Ledger|Aaro...,Christopher Nolan,Why So Serious?,Batman raises the stakes in his war on crime. ...,152,Drama|Action|Crime|Thriller,DC Comics|Legendary Pictures|Warner Bros.|Syncopy,2008-07-16,8.1,2008,816921825

# 10. Самый убыточный фильм за период с 2012 по 2014 г. (включительно)?

In [34]:
answers['10'] = '10. The Lone Ranger (tt1210819)'

In [35]:
data2 = data.query('2011 < release_year < 2015')
data2.query('profit == profit.min()')

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit
1245,tt1210819,255000000,89289910,The Lone Ranger,Johnny Depp|Armie Hammer|William Fichtner|Hele...,Gore Verbinski,Never Take Off the Mask,The Texas Rangers chase down a gang of outlaws...,149,Action|Adventure|Western,Walt Disney Pictures|Jerry Bruckheimer Films|I...,2013-07-03,6.0,2013,-165710090

In [36]:
# Variand 2:

data2 = data[(data['release_year'] > 2011) & (data['release_year'] < 2015)]
data2[data2['profit'] == data2['profit'].min()]

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit
1245,tt1210819,255000000,89289910,The Lone Ranger,Johnny Depp|Armie Hammer|William Fichtner|Hele...,Gore Verbinski,Never Take Off the Mask,The Texas Rangers chase down a gang of outlaws...,149,Action|Adventure|Western,Walt Disney Pictures|Jerry Bruckheimer Films|I...,2013-07-03,6.0,2013,-165710090

# 11. Какого жанра фильмов больше всего?

In [37]:
answers['11'] = '11. Drama'

In [38]:
# превращаем все в одну строку
data['genres'].str.cat(sep='|')
# создаем список разделяя строку по '|'
# считаем количество элементов в серии
pd.Series(data['genres'].str.cat(sep='|').split('|')).value_counts().head(1)

Drama    782
dtype: int64

ВАРИАНТ 2

In [39]:
all_genres_list = data['genres'].str.cat(sep='|').split('|')
count_genre = []
genres_list = []

for genre in all_genres_list: # Count the number of matches and create a list 
                              # of genres
    if genre not in genres_list:
        count_genre.append(all_genres_list.count(genre))
        genres_list.append(genre)
        
data3 = pd.DataFrame()
data3 = pd.DataFrame({'genres': genres_list, 'count': count_genre})
data3.sort_values(by = 'count', ascending = False).head(1)

  genres  count
7  Drama    782

# 12. Фильмы какого жанра чаще всего становятся прибыльными?

In [40]:
answers['12'] = '12. Drama'

In [41]:
all_genres = data['genres'].str.cat(sep='|').split('|')
genres_list = []
profit_list = []
count_films_genre = []
data2 = data.query('profit > 0')

for genre in all_genres: # Count the number of films of a certain genre and
                         # create a list of genres
    if genre not in genres_list:
        genres_list.append(genre)
        count_films_genre.append(data2[data2.genres.str.contains\
            (genre, na=False)].imdb_id .count())

data3 = pd.DataFrame()
data3 = pd.DataFrame({'genres': genres_list, 'count_films': count_films_genre})
data3.sort_values(by = 'count_films', ascending = False).head(1)

  genres  count_films
7  Drama          560

In [42]:
# Variand 2:

all_genres = data['genres'].str.cat(sep='|').split('|')
genres_list = []
profit_list = []
count_films_genre = []
data2 = data[data['profit'] > 0]

for genre in all_genres: # Count the number of films of a certain genre and
                         # create a list of genres
    if genre not in genres_list:
        genres_list.append(genre)
        count_films_genre.append(data2[data2.genres.str.contains\
            (genre, na=False)].imdb_id .count())

data3 = pd.DataFrame()
data3 = pd.DataFrame({'genres': genres_list, 'count_films': count_films_genre})
data3.sort_values(by = 'count_films', ascending = False).head(1)

  genres  count_films
7  Drama          560

# 13. У какого режиссера самые большие суммарные кассовые сборы?

In [43]:
answers['13'] = '13. Peter Jackson'

In [76]:
all_director = data['director'].str.cat(sep='|').split('|')
director_list = []
revenue_sum = []
data2 = data

for director in all_director: # Count the total fees of each director and
                              # create a list of directors
    if director not in director_list:
        director_list.append(director)
        revenue_sum.append(data2[data2.director.str.contains\
            (director, na=False)].revenue.sum())

data3 = pd.DataFrame()
data3 = pd.DataFrame({'director': director_list, 'revenue_sum': revenue_sum})
data3.sort_values(by = 'revenue_sum', ascending = False)

              director  revenue_sum
128      Peter Jackson   6490593685
122  Christopher Nolan   4167548502
244        David Yates   4154295625
141        Michael Bay   3886938960
3          J.J. Abrams   3579169916
..                 ...          ...
212      David MichÃ´d      2295423
859   Steven Shainberg      2281089
666      Paul Schrader      2062066
794       Keanu Reeves      2054941
559       Simon Hunter      2033165

[997 rows x 2 columns]

# 14. Какой режисер снял больше всего фильмов в стиле Action?

In [45]:
answers['14'] = '14. Robert Rodriguez'

In [80]:
data2 = data
count_films = []

for director in director_list: # Create a list of the number of Action films
                               #  of each director
    count_films.append(data2[(data2.director.str.contains\
    (director, na=False)) & data2.genres.str.contains('Action', na=False)]\
        .imdb_id.count())
    
data3 = pd.DataFrame()
data3 = pd.DataFrame({'director': director_list, 'count_films': count_films})
data3.sort_values(by = 'count_films', ascending = False)

                director  count_films
190     Robert Rodriguez            9
197   Paul W.S. Anderson            7
141          Michael Bay            7
23         Antoine Fuqua            6
7           Ridley Scott            6
..                   ...          ...
441          J.B. Rogers            0
442         Baz Luhrmann            0
443            Ted Demme            0
444  Jean-Jacques Annaud            0
996         Mary Lambert            0

[997 rows x 2 columns]

# 15. Фильмы с каким актером принесли самые высокие кассовые сборы в 2012 году?

In [49]:
answers['15'] = '15. Chris Hemsworth'

In [50]:
data2 = data[data.release_year == 2012]
all_cast = data['cast'].str.cat(sep='|').split('|')
cast_list = []
revenue_cast_2012 = []

for cast in all_cast: # Create a list of casts and calculate the casts
                      # box office
    if cast not in cast_list:
        cast_list.append(cast)
        revenue_cast_2012.append(data2[data2.cast.str.contains(cast, na=False)]\
            .revenue.sum())

data3 = pd.DataFrame()
data3 = pd.DataFrame({'cast': cast_list, 'revenue_cast': revenue_cast_2012})
data3.sort_values(by = 'revenue_cast', ascending = False)

                   cast  revenue_cast
69      Chris Hemsworth    2027450773
2120        Denis Leary    1629460639
214       Anne Hathaway    1522851057
68    Robert Downey Jr.    1519557910
70         Mark Ruffalo    1519557910
...                 ...           ...
1310      Geoffrey Rush             0
1312      Dejan Angelov             0
1313      DragoÈ™ Bucur             0
1315  Carice van Houten             0
3405        Tess Harper             0

[3406 rows x 2 columns]

# 16. Какой актер снялся в большем количестве высокобюджетных фильмов?

In [51]:
answers['16'] = '16. Matt Damon'

In [52]:
data2 = data.query('budget > budget.mean()')
count_films = []

for cast in cast_list: # Count the number of films with each actor
    count_films.append(data2[data2.cast.str.contains(cast, na=False)]\
        .imdb_id.count())
    
data3 = pd.DataFrame()
data3 = pd.DataFrame({'cast': cast_list, 'count': count_films})
data3.sort_values(by = 'count', ascending = False)

                   cast  count
34           Matt Damon     18
63         Adam Sandler     17
596      Angelina Jolie     16
73    Samuel L. Jackson     15
121          Tom Cruise     15
...                 ...    ...
1710          Josh Peck      0
1708          Nora Dunn      0
1707       Alex D. Linz      0
176         Emory Cohen      0
3405        Tess Harper      0

[3406 rows x 2 columns]

# 17. В фильмах какого жанра больше всего снимался Nicolas Cage?

In [53]:
answers['17'] = '17. Action'

In [54]:
data2 = data[data.cast.str.contains('Nicolas Cage', na=False)]
cage_genres = []

for genre in genres_list: # Count the number of films
    cage_genres.append(data2[data2.genres.str.contains(genre, na=False)]\
        .imdb_id.count())

data3 = pd.DataFrame()
data3 = pd.DataFrame({'genres': genres_list, 'count': cage_genres})
data3.sort_values(by = 'count', ascending = False)

             genres  count
0            Action     17
3          Thriller     15
7             Drama     12
5             Crime     10
4           Fantasy      8
1         Adventure      7
10           Comedy      6
2   Science Fiction      4
11          Mystery      3
9         Animation      3
8            Family      3
14          History      2
12          Romance      1
13              War      1
16           Horror      1
6           Western      0
15            Music      0
17      Documentary      0
18          Foreign      0

# 18. Самый убыточный фильм от Paramount Pictures

In [55]:
answers['18'] = '18. K-19: The Widowmaker (tt0267626)'

In [56]:
data2 = data
production_companies = data2['production_companies'].str.cat(sep='|')\
    .split('|')
companies = []

for companie in production_companies: # Creating a list of companies
    if companie not in companies:
        companies.append(companie)

data2[data2.production_companies.str.contains('Paramount Pictures', na=False)]\
    .query('profit == profit.min()')

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit
925,tt0267626,100000000,35168966,K-19: The Widowmaker,Harrison Ford|Liam Neeson|Peter Sarsgaard|Joss...,Kathryn Bigelow,Fate has found its hero.,When Russia's first nuclear submarine malfunct...,138,Thriller|Drama|History,Paramount Pictures|Intermedia Films|National G...,2002-07-19,6.0,2002,-64831034

# 19. Какой год стал самым успешным по суммарным кассовым сборам?

In [57]:
answers['19'] = '19. 2015'

In [58]:
data2 = data
list_years = data2.release_year.unique()
revenue_years = []

for year in list_years: # Calculate the total box office receipts for each year
    revenue_years.append(data2[data2.release_year == year].revenue.sum())

data3 = pd.DataFrame()
data3 = pd.DataFrame({'year': list_years, 'revenue': revenue_years})
data3.sort_values(by = 'revenue', ascending = False)

    year      revenue
0   2015  25449202382
1   2014  23405862953
10  2013  23213799791
8   2012  23079001687
6   2011  22676791872
3   2010  21071204961
2   2009  20261791024
5   2008  18252781990
14  2007  18162406801
13  2004  15663430720
11  2005  15309425558
12  2006  14775042320
9   2003  14346123312
7   2002  14136361487
4   2001  13017764865
15  2000  10664099805

# 20. Какой самый прибыльный год для студии Warner Bros?

In [59]:
answers['20'] = '20. 2014'

In [60]:
data2 = data[data.production_companies.str.contains('Warner Bros', na=False)]
profit_years = []

for year in list_years: # Calculate the profit for each year
    profit_years.append(data2[data2['release_year'] == year].profit.sum())
    
data3 = pd.DataFrame()
data3 = pd.DataFrame({'year': list_years, 'profit': profit_years})
data3.sort_values(by = 'profit', ascending = False)

    year      profit
1   2014  2295464519
14  2007  2201675217
5   2008  2134595031
3   2010  1974712985
6   2011  1871393682
9   2003  1855493377
2   2009  1822454136
10  2013  1636453400
13  2004  1631933725
11  2005  1551980298
4   2001  1343545668
8   2012  1258020056
7   2002  1022709901
0   2015   870368348
12  2006   620170743
15  2000   452631386

# 21. В каком месяце за все годы суммарно вышло больше всего фильмов?

In [61]:
answers['21'] = '21. Сентябрь'

In [62]:
data2 = data
data2.release_date.dt.month.value_counts()

9     227
12    190
10    186
8     161
3     156
4     149
6     147
11    146
7     142
5     140
2     135
1     110
Name: release_date, dtype: int64

# 22. Сколько суммарно вышло фильмов летом? (за июнь, июль, август)

In [63]:
answers['22'] = '22. 450'

In [64]:
data2.query('5 < release_date.dt.month < 9').imdb_id.count()

450

# 23. Для какого режиссера зима – самое продуктивное время года?

In [65]:
answers['23'] = '23. Peter Jackson'

In [81]:
data2 = data.query('release_date.dt.month < 3 | release_date.dt.month == 12')
count_films = []

for director in director_list: # Count the number of films of all directors
    count_films.append(data2[data2.director.str.contains(director, na=False)]\
        .imdb_id.count())

data3 = pd.DataFrame()
data3 = pd.DataFrame({'director': director_list, 'count': count_films})
data3.sort_values(by = 'count', ascending = False)

                director  count
128        Peter Jackson      7
148       Clint Eastwood      6
289    Steven Soderbergh      6
134           Shawn Levy      4
349      Martin Scorsese      4
..                   ...    ...
447  Keenen Ivory Wayans      0
449    Lawrence Guterman      0
450          Chris Nahon      0
452   Hironobu Sakaguchi      0
996         Mary Lambert      0

[997 rows x 2 columns]

# 24. Какая студия дает самые длинные названия своим фильмам по количеству символов?

In [67]:
answers['24'] = '24. Four By Two Productions'

In [68]:
data2 = data
data2['symbols'] = data2.original_title.map(lambda x: len(x))
symbols = []

for company in companies: # Calculating the average length of movie titles
    symbols.append(data2[data2.production_companies.str.contains\
        (company, na=False)].symbols.mean())

data3 = pd.DataFrame()
data3 = pd.DataFrame({'company': companies, 'symbols': symbols})
data3.sort_values(by = 'symbols', ascending = False)

C:\anaconda3\lib\site-packages\pandas\core\strings.py:1952: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  return func(self, *args, **kwargs)

                                                company  symbols
1505                            Four By Two Productions     83.0
389                             Jim Henson Company, The     59.0
1211                                      Dos Corazones     47.0
450                           Museum Canada Productions     46.0
547                                        Polsky Films     46.0
...                                                 ...      ...
1451                  Warner Independent Pictures (WIP)      NaN
1485                            The Movie Network (TMN)      NaN
1721  Munich Film Partners & Company (MFP) MI2 Produ...      NaN
1731                                Danmarks Radio (DR)      NaN
1754  Munich Film Partners & Company (MFP) ROE Produ...      NaN

[1771 rows x 2 columns]

# 25. Описание фильмов какой студии в среднем самые длинные по количеству слов?

In [69]:
answers['25'] = '25. Midnight Picture Show'

In [70]:
data2 = data
data2['words'] = data2.overview.map(lambda x: len(x.split()))
data2
words = []

for company in companies: # Calculate the average value according to the
                          # description of films
    words.append(data2[data2.production_companies.str.contains\
        (company, na=False)].words.mean())
    
data3 = pd.DataFrame()
data3 = pd.DataFrame({'company': companies, 'words': words})
data3.sort_values(by = 'words', ascending = False)

C:\anaconda3\lib\site-packages\pandas\core\strings.py:1952: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  return func(self, *args, **kwargs)

                                                company  words
950                               Midnight Picture Show  175.0
1445                               Room 9 Entertainment  161.0
1141                                 98 MPH Productions  159.0
1232                     Heineken Branded Entertainment  159.0
1039                   Brookwell-McNamara Entertainment  156.0
...                                                 ...    ...
1451                  Warner Independent Pictures (WIP)    NaN
1485                            The Movie Network (TMN)    NaN
1721  Munich Film Partners & Company (MFP) MI2 Produ...    NaN
1731                                Danmarks Radio (DR)    NaN
1754  Munich Film Partners & Company (MFP) ROE Produ...    NaN

[1771 rows x 2 columns]

# 26. Какие фильмы входят в 1 процент лучших по рейтингу? 
по vote_average

In [71]:
answers['26'] = '26. Inside Out, The Dark Knight, 12 Years a Slave'

In [72]:
data[data.vote_average > data.vote_average.quantile(0.99)]['original_title']

9                                          Inside Out
34                                               Room
118                                      Interstellar
119                           Guardians of the Galaxy
125                                The Imitation Game
128                                         Gone Girl
138                          The Grand Budapest Hotel
370                                         Inception
599                                   The Dark Knight
872                                       The Pianist
1081    The Lord of the Rings: The Return of the King
1183                          The Wolf of Wall Street
1191                                 12 Years a Slave
1800                                          Memento
Name: original_title, dtype: object

# 27. Какие актеры чаще всего снимаются в одном фильме вместе?

In [73]:
answers['27'] = '27. Daniel Radcliffe & Rupert Grint'

In [74]:
cast_list = data.cast.str.split('|').tolist()
coincidences_list = []

for i in cast_list: # Count the number of matches
    for j in it.combinations(i, 2):
        coincidences_list.append(' '.join(j))
        
coincidences = pd.DataFrame(coincidences_list)
coincidences.columns = ['coincidences']
coincidences.coincidences.value_counts().head(10)

Daniel Radcliffe Emma Watson        8
Daniel Radcliffe Rupert Grint       8
Rupert Grint Emma Watson            7
Johnny Depp Helena Bonham Carter    6
Ben Stiller Owen Wilson             6
Robert Pattinson Taylor Lautner     5
Adam Sandler Kevin James            5
Hugh Jackman Ian McKellen           5
Kristen Stewart Taylor Lautner      5
Kristen Stewart Robert Pattinson    5
Name: coincidences, dtype: int64

# Submission

In [75]:
answers

{'1': '1. Pirates of the Caribbean: On Stranger Tides (tt1298650)',
 '2': '2. Gods and Generals (tt0279111)',
 '3': '3. Winnie the Pooh (tt1449283)',
 '4': '4. 109.6585494970884',
 '5': '5. 107',
 '6': '6. Avatar (tt0499549)',
 '7': '7. The Lone Ranger (tt1210819)',
 '8': '8. 1478',
 '9': '9. The Dark Knight (tt0468569)',
 '10': '10. The Lone Ranger (tt1210819)',
 '11': '11. Drama',
 '12': '12. Drama',
 '13': '13. Peter Jackson',
 '14': '14. Robert Rodriguez',
 '15': '15. Chris Hemsworth',
 '16': '16. Matt Damon',
 '17': '17. Action',
 '18': '18. K-19: The Widowmaker (tt0267626)',
 '19': '19. 2015',
 '20': '20. 2014',
 '21': '21. Сентябрь',
 '22': '22. 450',
 '23': '23. Peter Jackson',
 '24': '24. Four By Two Productions',
 '25': '25. Midnight Picture Show',
 '26': '26. Inside Out, The Dark Knight, 12 Years a Slave',
 '27': '27. Daniel Radcliffe & Rupert Grint'}

# и убедиться что ни чего не пропустил)

In [82]:
len(answers)

27